package datastructure.tree;

/**
 * 霍夫曼树
 * 
 * @author liuyi27
 *         <p>
 *         霍夫曼树是二叉树的一种特殊形式，又称为最优二叉树，其主要作用在于数据压缩和编码长度的优化。
 *         </p>
 *
 *         <p>
 *         路径和路径长度:
 *         在一棵树中，从一个结点往下可以达到的孩子或孙子结点之间的通路，称为路径。通路中分支的数目称为路径长度。若规定根结点的层数为1，则从根结点到第L层结点的路径长度为L-1。
 *         </p>
 * 
 *         <p>
 *         结点的权及带权路径长度:若将树中结点赋给一个有着某种含义的数值，则这个数值称为该结点的权。结点的带权路径长度为：从根结点到该结点之间的路径长度与该结点的权的乘积。
 *         </p>
 * 
 *         <p>
 *         </p>
 * 
 *         <p>
 *         </p>
 */
public class HoffmanTree {

	
}
